In [1]:
import pandas as pd
pd.__version__

'1.0.1'

In [2]:
import numpy as np  
np.__version__

'1.18.1'

In [4]:
# 리스트로 시리즈 생성
se = pd.Series([1,3,'One'], index=list('ABC'))

In [5]:
se

A      1
B      3
C    One
dtype: object

In [13]:
# 넘파이 배열로 시리즈 생성 
n_se = pd.Series(np.random.randn(3), index=list('ABC'))

In [14]:
n_se

A    0.576868
B    1.161323
C   -1.290661
dtype: float64

In [15]:
# 누락값 데이터 타입 확인
Nan_se = pd.Series([1,np.nan,2])

In [16]:
Nan_se

0    1.0
1    NaN
2    2.0
dtype: float64

In [17]:
# 리스트로 데이터프레임 생성
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], index=list('ABC'), columns=['One','Two','Three'])

In [18]:
df

   One  Two  Three
A    1    2      3
B    4    5      6
C    7    8      9

In [19]:
# 딕셔너리로 데이터프레임 생성
df2 = pd.DataFrame({'One' : [1,2,3], 'Two' : [4,5,6], 'Three' : [7,8,9]}, index=list('ABC'))

In [20]:
df2

   One  Two  Three
A    1    4      7
B    2    5      8
C    3    6      9

In [24]:
# 넘파이 배열로 데이터프레임 생성
df3 = pd.DataFrame({'One' : np.random.randint(10, size=3),
                   'Two' : np.random.randint(20, size=3),
                   'Three' : np.random.randint(30, size=3)}, index=list('ABC'))

In [25]:
df3

   One  Two  Three
A    8   19      3
B    4   14     12
C    6    0     19

In [7]:
# 시리즈로 데이터프레임 생성(s1)
s1 = pd.Series(np.random.randint(10, size=4), index=list('ABCD'))
s1

A    0
B    0
C    2
D    6
dtype: int64

In [8]:
# 시리즈로 데이터프레임 생성(s2)
s2 = pd.Series(np.random.randint(20, size=4), index=list('ABCD'))
s2

A     4
B    16
C     0
D    17
dtype: int64

In [11]:
df4 = pd.DataFrame({'One' : s1 , 'Two' : s2})

In [12]:
df4

   One  Two
A    0    4
B    0   16
C    2    0
D    6   17

In [14]:
df = pd.read_csv('../Pandas/premier_league.csv')
df

,home_team,away_team,home_goals,away_goals,result,season
0,TottenhamHotspur,ManchesterCity,0,0,D,2010-2011
1,AstonVilla,WestHamUnited,3,0,H,2010-2011
2,BlackburnRovers,Everton,1,0,H,2010-2011
3,BoltonWanderers,Fulham,0,0,D,2010-2011
4,Sunderland,BirminghamCity,2,2,D,2010-2011
...,...,...,...,...,...,...
3663,Liverpool,Southampton,4,0,H,NaN
3664,NewcastleUnited,NorwichCity,0,0,D,NaN
3665,Watford,Everton,2,3,A,NaN
3666,WestHamUnited,BrightonandHoveAlbion,3,3,D,NaN
3667,ManchesterUnited,WolverhamptonWanderers,0,0,D,NaN

In [15]:
# 위에서 5개의 행 출력(매개변수의 기본값이 5이다.)
df.head()

          home_team       away_team  home_goals  away_goals result     season
0  TottenhamHotspur  ManchesterCity           0           0      D  2010-2011
1        AstonVilla   WestHamUnited           3           0      H  2010-2011
2   BlackburnRovers         Everton           1           0      H  2010-2011
3   BoltonWanderers          Fulham           0           0      D  2010-2011
4        Sunderland  BirminghamCity           2           2      D  2010-2011

In [16]:
# 아래에서 7개의 행 출력
df.tail(7)

,home_team,away_team,home_goals,away_goals,result,season
3661,AFCBournemouth,Astonvilla,2,1,H,NaN
3662,CrystalPalace,SheffieldUnited,0,1,A,NaN
3663,Liverpool,Southampton,4,0,H,NaN
3664,NewcastleUnited,NorwichCity,0,0,D,NaN
3665,Watford,Everton,2,3,A,NaN
3666,WestHamUnited,BrightonandHoveAlbion,3,3,D,NaN
3667,ManchesterUnited,WolverhamptonWanderers,0,0,D,NaN

In [18]:
# 행의 레이블 확인
df.index

RangeIndex(start=0, stop=3668, step=1)

In [19]:
# 열의 레이블 확인
df.columns

Index(['home_team', 'away_team', 'home_goals', 'away_goals', 'result',
       'season'],
      dtype='object')

In [32]:
df.head(3).to_numpy()

array([['TottenhamHotspur', 'ManchesterCity', 0, 0, 'D', '2010-2011'],
       ['AstonVilla', 'WestHamUnited', 3, 0, 'H', '2010-2011'],
       ['BlackburnRovers', 'Everton', 1, 0, 'H', '2010-2011']],
      dtype=object)

In [25]:
df2 = pd.DataFrame({'One' : [1,2,3], 'Two' : [4,5,6], 'Three' : [7,8,9], 'Four' : [10,11,12], 'Five' : [13,14,15],
      'Six' : [16,17,18]})
df2

   One  Two  Three  Four  Five  Six
0    1    4      7    10    13   16
1    2    5      8    11    14   17
2    3    6      9    12    15   18

In [33]:
df2.to_numpy()

array([[ 1,  4,  7, 10, 13, 16],
       [ 2,  5,  8, 11, 14, 17],
       [ 3,  6,  9, 12, 15, 18]])

In [34]:
df.describe()

        home_goals   away_goals
count  3668.000000  3668.000000
mean      1.551799     1.198201
std       1.297052     1.169668
min       0.000000     0.000000
25%       1.000000     0.000000
50%       1.000000     1.000000
75%       2.000000     2.000000
max       8.000000     9.000000

In [37]:
df.describe().T

             count      mean       std  min  25%  50%  75%  max
home_goals  3668.0  1.551799  1.297052  0.0  1.0  1.0  2.0  8.0
away_goals  3668.0  1.198201  1.169668  0.0  0.0  1.0  2.0  9.0

In [53]:
# 열의 레이블 정렬(내림차순)
df2.sort_index(axis=1, ascending=False)

   Two  Three  Six  One  Four  Five
0    4      7   16    1    10    13
1    5      8   17    2    11    14
2    6      9   18    3    12    15

In [54]:
# 열의 레이블 정렬(오름차순)
df2.sort_index(axis=1, ascending=True)

   Five  Four  One  Six  Three  Two
0    13    10    1   16      7    4
1    14    11    2   17      8    5
2    15    12    3   18      9    6

In [49]:
df3 = pd.DataFrame({'A' : [1,2,3,4], 'B' : [5,6,7,8]}, index=list('DACB'))

In [50]:
df3

   A  B
D  1  5
A  2  6
C  3  7
B  4  8

In [51]:
# 행의 레이블 정렬(내림차순)
df3.sort_index(axis=0, ascending=False)

   A  B
D  1  5
C  3  7
B  4  8
A  2  6

In [52]:
# 행의 레이블 정렬(오름차순)
df3.sort_index(axis=0, ascending=True)

   A  B
A  2  6
B  4  8
C  3  7
D  1  5

In [57]:
# 시리즈의 행 레이블 정렬
series = pd.Series(np.random.randint(5, size=3), index=list('BAC'))

In [58]:
series.sort_index(axis=0)

A    3
B    3
C    3
dtype: int64

In [64]:
# home_team열의 값들을 기준으로 정렬(기본값: 오름차순)
df.sort_values(by='home_team').head()

           home_team       away_team  home_goals  away_goals result     season
2529  AFCBournemouth  ManchesterCity           0           2      A  2016-2017
2808  AFCBournemouth     Southampton           1           1      D  2017-2018
1952  AFCBournemouth      Sunderland           2           0      H  2015-2016
2352  AFCBournemouth        HullCity           6           1      H  2016-2017
3080  AFCBournemouth   LeicesterCity           4           2      H  2018-2019

In [65]:
# home_team열의 값들을 기준으로 내림차순 정렬
df.sort_values(by='home_team', ascending=False).head()

,home_team,away_team,home_goals,away_goals,result,season
685,WolverhamptonWanderers,BoltonWanderers,2,3,A,2011-2012
517,WolverhamptonWanderers,Sunderland,2,1,H,2011-2012
3267,WolverhamptonWanderers,LeicesterCity,4,3,H,2018-2019
3275,WolverhamptonWanderers,WestHamUnited,3,0,H,2018-2019
533,WolverhamptonWanderers,StokeCity,1,2,A,2011-2012

In [66]:
df2

   One  Two  Three  Four  Five  Six
0    1    4      7    10    13   16
1    2    5      8    11    14   17
2    3    6      9    12    15   18

In [67]:
df2['One']

0    1
1    2
2    3
Name: One, dtype: int64

In [70]:
df2.One

0    1
1    2
2    3
Name: One, dtype: int64

In [71]:
df3

   A  B
D  1  5
A  2  6
C  3  7
B  4  8

In [72]:
df3[0:2]

   A  B
D  1  5
A  2  6

In [73]:
df3['A':'B']

   A  B
A  2  6
C  3  7
B  4  8

In [74]:
df

,home_team,away_team,home_goals,away_goals,result,season
0,TottenhamHotspur,ManchesterCity,0,0,D,2010-2011
1,AstonVilla,WestHamUnited,3,0,H,2010-2011
2,BlackburnRovers,Everton,1,0,H,2010-2011
3,BoltonWanderers,Fulham,0,0,D,2010-2011
4,Sunderland,BirminghamCity,2,2,D,2010-2011
...,...,...,...,...,...,...
3663,Liverpool,Southampton,4,0,H,NaN
3664,NewcastleUnited,NorwichCity,0,0,D,NaN
3665,Watford,Everton,2,3,A,NaN
3666,WestHamUnited,BrightonandHoveAlbion,3,3,D,NaN
3667,ManchesterUnited,WolverhamptonWanderers,0,0,D,NaN

In [80]:
df3

   A  B
D  1  5
A  2  6
C  3  7
B  4  8

In [81]:
df3.loc['D']

A    1
B    5
Name: D, dtype: int64

In [82]:
df3.loc['D','A']

1

In [86]:
df3.iloc[1]

A    2
B    6
Name: A, dtype: int64

In [87]:
df3.iloc[0:2, 0]

D    1
A    2
Name: A, dtype: int64

In [89]:
df.iloc[[0,2],[0,4]]

          home_team result
0  TottenhamHotspur      D
2   BlackburnRovers      H

In [91]:
df.iloc[-1]

home_team           ManchesterUnited
away_team     WolverhamptonWanderers
home_goals                         0
away_goals                         0
result                             D
season                           NaN
Name: 3667, dtype: object

In [95]:
df3[df3['A'] > 2]

   A  B
C  3  7
B  4  8

In [96]:
df3[df3 > 2]

     A  B
D  NaN  5
A  NaN  6
C  3.0  7
B  4.0  8

In [100]:
df[df['result'].isin(['H','A'])].head()

,home_team,away_team,home_goals,away_goals,result,season
1,AstonVilla,WestHamUnited,3,0,H,2010-2011
2,BlackburnRovers,Everton,1,0,H,2010-2011
5,WiganAthletic,Blackpool,0,4,A,2010-2011
6,WolverhamptonWanderers,StokeCity,2,1,H,2010-2011
7,Chelsea,WestBromwichAlbion,6,0,H,2010-2011

In [162]:
# 데이터프레임 생성
df = pd.DataFrame({'One' : [1,2,3,4,5], 'Two' : [6,7,8,9,10]})
df

   One  Two
0    1    6
1    2    7
2    3    8
3    4    9
4    5   10

In [163]:
# 시리즈 생성
series = np.random.randint(50, size=5)
series

array([47,  4, 35,  6, 28])

In [164]:
# 시리즈를 데이터프레임의 새로운 열로 추가
df['Three'] = series

In [165]:
df

   One  Two  Three
0    1    6     47
1    2    7      4
2    3    8     35
3    4    9      6
4    5   10     28

In [174]:
# 특정 열의 전체 데이터값 변경
df.loc[:, 'Two'] = np.array(np.random.randint(100,size=5))

In [175]:
df

   One  Two  Three
0    1    1     47
1    2   85      4
2    3   51     35
3    4    5      6
4    5   71     28

In [177]:
# 특정 조건에 의한 데이터프레임 내부 값 변경
df[df > 5] = -df

In [178]:
df

   One  Two  Three
0    1    1    -47
1    2  -85      4
2    3  -51    -35
3    4    5     -6
4    5  -71    -28

In [3]:
df = pd.DataFrame(data=[[1,2,np.nan],[3,np.nan,4]])
df

   0    1    2
0  1  2.0  NaN
1  3  NaN  4.0

In [4]:
df[1].sum()

2.0

In [5]:
df[0].sum()

4

In [6]:
df[2].sum()

4.0

In [8]:
df1 = df.reindex(index=np.arange(5))

In [9]:
df1

     0    1    2
0  1.0  2.0  NaN
1  3.0  NaN  4.0
2  NaN  NaN  NaN
3  NaN  NaN  NaN
4  NaN  NaN  NaN

In [10]:
df1.dropna(how='any')

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [11]:
df1.fillna(value=10)

      0     1     2
0   1.0   2.0  10.0
1   3.0  10.0   4.0
2  10.0  10.0  10.0
3  10.0  10.0  10.0
4  10.0  10.0  10.0

In [12]:
pd.isna(df1)

       0      1      2
0  False  False   True
1  False   True  False
2   True   True   True
3   True   True   True
4   True   True   True

In [15]:
df = pd.DataFrame({'One' : np.random.randint(20, size=4), 
                  'Two' : np.random.randn(4)},
                 index=list('ABCD'))

In [16]:
df

   One       Two
A   17 -0.777915
B   19 -1.434760
C    2  0.921095
D   14  0.263641

In [17]:
df.mean()

One    13.000000
Two    -0.256985
dtype: float64

In [18]:
df.mean(1)

A    8.111043
B    8.782620
C    1.460547
D    7.131821
dtype: float64

In [20]:
# 시리즈와 데이터프레임에 사용할 인덱스 생성(시계열)
t_idx = pd.date_range('2020-01-01', periods=5)

In [21]:
t_idx

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05'],
              dtype='datetime64[ns]', freq='D')

In [37]:
# 시계열 인덱스를 사용하여 5개의 난수를 가지는 시리즈를 생성. 
series = pd.Series(np.random.randint(20, size=5), index=t_idx)

In [38]:
series

2020-01-01    17
2020-01-02    16
2020-01-03    18
2020-01-04     6
2020-01-05     9
Freq: D, dtype: int64

In [39]:
# 시리즈의 요소들을 우측으로 1씩 이동
series = series.shift(1)

In [40]:
series

2020-01-01     NaN
2020-01-02    17.0
2020-01-03    16.0
2020-01-04    18.0
2020-01-05     6.0
Freq: D, dtype: float64

In [35]:
# 시계열 인덱스를 가지는 5X2 크기의 데이터프레임을 생성
df = pd.DataFrame({ 'A' : np.random.randn(5), 'B' : np.random.randn(5)}, index=t_idx)

In [36]:
df

                   A         B
2020-01-01 -0.243296  0.370846
2020-01-02 -0.320402  0.566230
2020-01-03  0.680802 -0.485805
2020-01-04  0.376472 -1.527842
2020-01-05 -0.404380 -0.372984

In [41]:
# 행을 기준으로 시리즈와 데이터프레임의 차(subtraction)를 구함. 
df.sub(series, axis='index')

                    A          B
2020-01-01        NaN        NaN
2020-01-02 -17.320402 -16.433770
2020-01-03 -15.319198 -16.485805
2020-01-04 -17.623528 -19.527842
2020-01-05  -6.404380  -6.372984

In [42]:
# 열을 기준으로 시리즈와 데이터프레임의 차(subtraction)를 구함. 
df.sub(series, axis='columns')

,2020-01-01 00:00:00,2020-01-02 00:00:00,2020-01-03 00:00:00,2020-01-04 00:00:00,2020-01-05 00:00:00,A,B
2020-01-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2020-01-02,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2020-01-03,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2020-01-04,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2020-01-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [44]:
df.apply(np.sum)

A    0.089196
B   -1.449555
dtype: float64

In [46]:
df.apply(lambda x : x * 1000)

                     A            B
2020-01-01 -243.296000   370.845837
2020-01-02 -320.401912   566.229513
2020-01-03  680.802131  -485.804716
2020-01-04  376.472100 -1527.841624
2020-01-05 -404.380176  -372.984363

In [47]:
series2 = pd.Series(np.random.randint(2, 20, size=10))
series2

0     2
1    16
2    19
3     6
4    16
5     7
6     6
7     4
8    12
9     5
dtype: int64

In [48]:
series2.value_counts()

6     2
16    2
12    1
7     1
5     1
4     1
19    1
2     1
dtype: int64

In [49]:
s = pd.Series(['Ss','Aa','Bb','Cc',np.nan,'Ff','AbCdEfG'])
s

0         Ss
1         Aa
2         Bb
3         Cc
4        NaN
5         Ff
6    AbCdEfG
dtype: object

In [50]:
# 문자열 요소 소문자로 변환
s.str.lower()

0         ss
1         aa
2         bb
3         cc
4        NaN
5         ff
6    abcdefg
dtype: object

In [51]:
# 문자열 요소 대문자로 변환
s.str.upper()

0         SS
1         AA
2         BB
3         CC
4        NaN
5         FF
6    ABCDEFG
dtype: object